# Pandas

In [3]:
import numpy as np
import pandas as pd

## Series
Similar to numpy array. Difference between Numpy array and Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.

### Creating a Series

In [2]:
labels = ['a','b','c','d']
my_list = [10,20,30,40]
arr = np.array([10,20,30,40])
d = {'a':10,'b':20,'c':30,'d':40}

#### 1. Using Lists

In [3]:
pd.Series(data = my_list)

0    10
1    20
2    30
3    40
dtype: int64

In [4]:
pd.Series(data=my_list, index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [6]:
pd.Series(my_list,labels)

a    10
b    20
c    30
d    40
dtype: int64

#### 2. Numpy Arrays

In [7]:
pd.Series(arr)

0    10
1    20
2    30
3    40
dtype: int64

In [8]:
pd.Series(arr,labels)

a    10
b    20
c    30
d    40
dtype: int64

#### 3. Dictionaries

In [9]:
pd.Series(d)

a    10
b    20
c    30
d    40
dtype: int64

#### Data in a Series

In [10]:
pd.Series(data=labels, index=my_list)

10    a
20    b
30    c
40    d
dtype: object

**Sereis can hold functions also.**

In [11]:
pd.Series([sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

### Using an Index.
The key to using Series is understanding its index. Pandas makes use of these index names or numbers by allowing for fast look ups of information

In [12]:
ser1 = pd.Series([1,2,3,4], index=['USA','Germany','USSR','Japan'])

In [13]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [14]:
ser2 = pd.Series([1,2,5,4], index=['USA','Germany','Italy','Japan'])

In [15]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [16]:
ser1['USA']

1

In [18]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

## DataFrames
DataFrames are bunch of Series objects put togather to share same index.

In [19]:
from numpy.random import randn 
np.random.seed(101)

In [21]:
np.random.randn(5,4)

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [24]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'Sid Karan Kushal Anuraag'.split())

In [25]:
df

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

### Selection and Indexing

##### Selecting a column or columns

In [26]:
df['Sid']

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: Sid, dtype: float64

In [27]:
df[['Sid','Karan']]

        Sid     Karan
A -0.993263  0.196800
B  1.025984 -0.156598
C  2.154846 -0.610259
D  0.147027 -0.479448
E -0.925874  1.862864

In [28]:
df.Sid

A   -0.993263
B    1.025984
C    2.154846
D    0.147027
E   -0.925874
Name: Sid, dtype: float64

In [30]:
type(df.Sid) # Columns are just Series

pandas.core.series.Series

#### Creating a new column:

In [31]:
df['new'] = df['Sid'] + df['Karan']
df

        Sid     Karan    Kushal   Anuraag       new
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

#### Removing Columns

In [32]:
df.drop('new', axis=1)

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [51]:
df # Original dataframe will not affected by this. Unless you use "inplace", it will not drop or change orginal dataframe.

        Sid     Karan    Kushal   Anuraag       new
A -0.993263  0.196800 -1.136645  0.000366 -0.796464
B  1.025984 -0.156598 -0.031579  0.649826  0.869386
C  2.154846 -0.610259 -0.755325 -0.346419  1.544588
D  0.147027 -0.479448  0.558769  1.024810 -0.332421
E -0.925874  1.862864 -1.133817  0.610478  0.936990

In [52]:
df.drop('new', axis=1, inplace=True)
df

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [55]:
df.drop('E', axis=0)

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [35]:
df.sum(axis=1)

A   -2.729206
B    2.357019
C    1.987431
D    0.918737
E    1.350641
dtype: float64

#### Understing SUM function in Numpy and Pandas on axis. 
row = axis=0 sums vertically (down the columns)

Column = axis=1 sums horizontally (across the rows)

In [36]:
arr = np.array([[1,2,3],[4,5,6],[7,8,9]])
arr

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [47]:
data = pd.DataFrame(arr, index = 'a b c'.split(), columns='Sid Shubu Vedya'.split())
data

   Sid  Shubu  Vedya
a    1      2      3
b    4      5      6
c    7      8      9

In [48]:
print(arr.sum(axis=1))
print(data.sum(axis=1))

[ 6 15 24]
a     6
b    15
c    24
dtype: int64

In [49]:
print(arr.sum(axis=0))
print(data.sum(axis=0))

[12 15 18]
Sid      12
Shubu    15
Vedya    18
dtype: int64

### Selecting Rows

In [56]:
df

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [57]:
df.loc['A']

Sid       -0.993263
Karan      0.196800
Kushal    -1.136645
Anuraag    0.000366
Name: A, dtype: float64

In [59]:
df.iloc[0] # based off of position instead of label

Sid       -0.993263
Karan      0.196800
Kushal    -1.136645
Anuraag    0.000366
Name: A, dtype: float64

In [61]:
df.loc['B','Sid']

1.025984152081572

In [62]:
df.loc[['A','B'],['Sid','Kushal']]

        Sid    Kushal
A -0.993263 -1.136645
B  1.025984 -0.031579

### Conditional Selection

In [63]:
df

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [64]:
df[df>0]

        Sid     Karan    Kushal   Anuraag
A       NaN  0.196800       NaN  0.000366
B  1.025984       NaN       NaN  0.649826
C  2.154846       NaN       NaN       NaN
D  0.147027       NaN  0.558769  1.024810
E       NaN  1.862864       NaN  0.610478

In [65]:
df[df['Sid']>0]

        Sid     Karan    Kushal   Anuraag
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [66]:
df[df['Sid']>0]['Anuraag']

B    0.649826
C   -0.346419
D    1.024810
Name: Anuraag, dtype: float64

In [67]:
df[df['Sid']>0][['Karan','Kushal','Anuraag']]

      Karan    Kushal   Anuraag
B -0.156598 -0.031579  0.649826
C -0.610259 -0.755325 -0.346419
D -0.479448  0.558769  1.024810

#### For two conditions you can use | and & with parenthesis

In [71]:
df[(df['Sid']>0) & (df['Karan']<0)]

        Sid     Karan    Kushal   Anuraag
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [72]:
df[(df['Sid']>0) & (df['Karan']<0)][['Kushal','Anuraag']]

     Kushal   Anuraag
B -0.031579  0.649826
C -0.755325 -0.346419
D  0.558769  1.024810

### More Index Details

In [73]:
df

        Sid     Karan    Kushal   Anuraag
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [74]:
df.reset_index()

  index       Sid     Karan    Kushal   Anuraag
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [80]:
new = 'CA TX NY AZ CO'.split()

In [81]:
df['States'] = new

In [82]:
df

        Sid     Karan    Kushal   Anuraag States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     TX
C  2.154846 -0.610259 -0.755325 -0.346419     NY
D  0.147027 -0.479448  0.558769  1.024810     AZ
E -0.925874  1.862864 -1.133817  0.610478     CO

In [83]:
df.set_index('States')

             Sid     Karan    Kushal   Anuraag
States
CA     -0.993263  0.196800 -1.136645  0.000366
TX      1.025984 -0.156598 -0.031579  0.649826
NY      2.154846 -0.610259 -0.755325 -0.346419
AZ      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

In [84]:
df

        Sid     Karan    Kushal   Anuraag States
A -0.993263  0.196800 -1.136645  0.000366     CA
B  1.025984 -0.156598 -0.031579  0.649826     TX
C  2.154846 -0.610259 -0.755325 -0.346419     NY
D  0.147027 -0.479448  0.558769  1.024810     AZ
E -0.925874  1.862864 -1.133817  0.610478     CO

In [85]:
df.set_index('States', inplace=True)

In [86]:
df

             Sid     Karan    Kushal   Anuraag
States
CA     -0.993263  0.196800 -1.136645  0.000366
TX      1.025984 -0.156598 -0.031579  0.649826
NY      2.154846 -0.610259 -0.755325 -0.346419
AZ      0.147027 -0.479448  0.558769  1.024810
CO     -0.925874  1.862864 -1.133817  0.610478

### Multi-Index and Index Hierarchy

In [3]:
arrays = [["A","A","B","B"], ["one","two","one","two"]]
index = pd.MultiIndex.from_arrays(arrays,names=("letters","numbers"))

In [7]:
index

MultiIndex([('A', 'one'),
            ('A', 'two'),
            ('B', 'one'),
            ('B', 'two')],
           names=['letters', 'numbers'])

In [4]:
data = {
    "value1": [10,15,20,25],
    "value2": [5,10,15,20]
}

In [5]:
df = pd.DataFrame(data, index=index)
df

                 value1  value2
letters numbers
A       one          10       5
        two          15      10
B       one          20      15
        two          25      20

In [6]:
df.loc["A"]

         value1  value2
numbers
one          10       5
two          15      10

In [8]:
df.loc["A"].loc["one"]

value1    10
value2     5
Name: one, dtype: int64

In [10]:
df.loc["A"].iloc[0]

value1    10
value2     5
Name: one, dtype: int64

In [11]:
df.index.names

FrozenList(['letters', 'numbers'])

In [13]:
df

                 value1  value2
letters numbers
A       one          10       5
        two          15      10
B       one          20      15
        two          25      20

In [12]:
df.xs('A')

         value1  value2
numbers
one          10       5
two          15      10

In [14]:
df.xs(['A','one'])

/var/folders/lq/bb09dcm13557jqlh7zyq8n_c0000gn/T/ipykernel_2498/260856957.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['A','one'])

value1    10
value2     5
Name: (A, one), dtype: int64

In [15]:
df.xs(['A','one'])[1]

/var/folders/lq/bb09dcm13557jqlh7zyq8n_c0000gn/T/ipykernel_2498/1942387579.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['A','one'])[1]

5

In [16]:
df.xs('two',level='numbers')

         value1  value2
letters
A            15      10
B            25      20

## Missing Data

Pandas provides several methods and functions to work with missing values. Here's a comprehensive list of the most commonly used ones:

**1. Detecting missing values:**

isna() / isnull(): Detect missing values

notna() / notnull(): Detect non-missing values

**2 .Filling missing values:**

fillna(): Fill NA/NaN values using the specified method.

bfill() / backfill(): Backward fill NA/NaN values.

ffill() / pad(): Forward fill NA/NaN values.

interpolate(): Interpolate values according to different methods

**3. Dropping missing values:**

dropna(): Remove missing values

drop_duplicates(): Remove duplicate rows (can be used with subset parameter to consider only specific columns)

**4. Replacing values:**

replace(): Replace values given in 'to_replace' with 'value'

**5. Aggregation functions (with skipna parameter):**

sum(), mean(), median(), min(), max(), etc.

**6. Handling missing values in groupby operations:**

groupby().agg() with custom functions

groupby().transform() for filling group-specific values

**7. Mask operations:**

mask(): Replace values where the condition is True

where(): Replace values where the condition is False

**8. Time series-specific methods:**

asfreq(): Convert time series to specified frequency, can fill missing values

reindex(): Conform Series/DataFrame to new index, can fill missing values

**9. Covariance and correlation:**

cov(): Compute pairwise covariance, can handle missing values

corr(): Compute pairwise correlation, can handle missing values

**10. Windowing operations:**

rolling(): Provide rolling window calculations, can handle missing values

expanding(): Provide expanding transformations, can handle missing values

**11. String methods:**

str accessor methods like str.replace(), str.extract(), etc., can handle missing values

**12. Categorical operations:**

Categorical.add_categories(): Add new categories, can fill missing values

Categorical.remove_unused_categories(): Remove unused categories, can affect missing value representation

**13. MultiIndex operations:**

reindex() with fill_value parameter for multi-index Series/DataFrames

**14. Merge and join operations:**

merge(), join(): Can handle missing values during combining datasets

**15. Pivot and reshape operations:**

pivot_table(): Can specify how to handle missing values

melt(): Can affect how missing values are represented in long format

**16. IO operations:**

read_csv(), read_excel(), etc., with na_values parameter to specify additional strings to recognize as NA/NaN

**17. Data type conversion:**

astype(): Convert to a specified dtype, can affect how missing values are represented

**18. Indexing with missing values:**

loc[], iloc[]: Can be used to select or modify data including missing values

In [17]:
df = pd.DataFrame({'A':[1,2,np.nan],
                   'B':[5,np.nan,np.nan],
                   'C':[1,2,3]})

df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [20]:
df.dropna() # drops rows which contains null or missing values

     A    B  C
0  1.0  5.0  1

In [19]:
df.dropna(axis=1) # drops columns

   C
0  1
1  2
2  3

In [21]:
df.dropna(thresh=2) # Keep rows that has atleast 2 non NaN values. at least 2 non-NA values

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [30]:
df.dropna(thresh=2, axis=1) # keeps columns that has atleast 2 non NaN values

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [31]:
df.fillna(value='FILL VALUE')

            A           B  C
0         1.0         5.0  1
1         2.0  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [32]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

### Another example of Missing value and it's handling

In [33]:
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4, 5],
    'B': [np.nan, 2, 3, np.nan, 5],
    'C': [1, 2, 3, 4, np.nan],
    'D': ['a', 'b', np.nan, 'd', 'e']
})

In [34]:
df

     A    B    C    D
0  1.0  NaN  1.0    a
1  2.0  2.0  2.0    b
2  NaN  3.0  3.0  NaN
3  4.0  NaN  4.0    d
4  5.0  5.0  NaN    e

##### Filling with forward and backward fill limits:

In [35]:
df.ffill(limit=1)

     A    B    C  D
0  1.0  NaN  1.0  a
1  2.0  2.0  2.0  b
2  2.0  3.0  3.0  b
3  4.0  3.0  4.0  d
4  5.0  5.0  4.0  e

In [38]:
df

     A    B    C    D
0  1.0  NaN  1.0    a
1  2.0  2.0  2.0    b
2  NaN  3.0  3.0  NaN
3  4.0  NaN  4.0    d
4  5.0  5.0  NaN    e

In [39]:
df.bfill(limit=1)

     A    B    C  D
0  1.0  2.0  1.0  a
1  2.0  2.0  2.0  b
2  4.0  3.0  3.0  d
3  4.0  5.0  4.0  d
4  5.0  5.0  NaN  e

##### Replacing values with a dictionary:

In [40]:
df.replace({np.nan:'Missing'})

         A        B        C        D
0      1.0  Missing      1.0        a
1      2.0      2.0      2.0        b
2  Missing      3.0      3.0  Missing
3      4.0  Missing      4.0        d
4      5.0      5.0  Missing        e

In [55]:
df

     A    B    C    D
0  1.0  NaN  1.0    a
1  2.0  2.0  2.0    b
2  NaN  3.0  3.0  NaN
3  4.0  NaN  4.0    d
4  5.0  5.0  NaN    e

##### Handling missing values in string operations:
.str method works with an individual column. We can use .apply method to make changes to whole DataFrame.

In [60]:
df['D'].str.upper()

0      A
1      B
2    NaN
3      D
4      E
Name: D, dtype: object

##### Dropping duplicates while considering NaN:

In [61]:
df_dup = pd.DataFrame({'A': [1, 1, np.nan, np.nan, 2], 
                       'B': [1, 1, np.nan, np.nan, 2]})

df_dup

     A    B
0  1.0  1.0
1  1.0  1.0
2  NaN  NaN
3  NaN  NaN
4  2.0  2.0

In [62]:
df_dup.drop_duplicates()

     A    B
0  1.0  1.0
2  NaN  NaN
4  2.0  2.0

## Groupby 
Just like SQL. It allows you to group rows of data togather and call aggregate functions

In [1]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
        'Person': ['Sam','Charlie','Amy','Banessa','Carl','Sarah'],
        'Sales':[200,120,340,124,243,350]
        }

In [4]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Banessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [5]:
df.groupby('Company')

In [6]:
by_comp = df.groupby('Company')
by_comp

In [7]:
by_comp.mean()

/var/folders/lq/bb09dcm13557jqlh7zyq8n_c0000gn/T/ipykernel_19738/821838057.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [8]:
df.groupby('Company').mean()

/var/folders/lq/bb09dcm13557jqlh7zyq8n_c0000gn/T/ipykernel_19738/2058252646.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [9]:
by_comp.std()

/var/folders/lq/bb09dcm13557jqlh7zyq8n_c0000gn/T/ipykernel_19738/3391457442.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.std is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [10]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [11]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Banessa    340

In [12]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [13]:
by_comp.describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [19]:
by_comp.describe().loc['GOOG']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: GOOG, dtype: float64

## Merging, Joining and Concatenating

In [20]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [21]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [22]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [24]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [25]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [26]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

#### Concatenation
It basically glues togather DataFrames. Dimensions should match aling the axis you are concatenating on.

In [27]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [28]:
pd.concat([df1,df2,df3], axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [29]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [30]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [31]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

#### Merging
Similar as merging SQL tables togather

In [32]:
pd.merge(left,right, how='inner',on="key")

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [33]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [34]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [35]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [36]:
pd.merge(left, right, on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [39]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [40]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [38]:
pd.merge(left, right, how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [41]:
pd.merge(left, right, how='outer',on=['key1','key2'])

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

#### Joining
It is a convenient method for combining the columns of two potentially differnet-indexed DataFrames into a single result DataFrame.

In [42]:
left = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

right = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])

In [43]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [44]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [45]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [46]:
left.join(right, how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Operation

In [47]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

##### Info in unique vales

In [49]:
df['col2'].unique() # Gives unique values

array([444, 555, 666])

In [51]:
df['col2'].nunique() # Gives how many unique values are there.

3

In [53]:
df['col2'].value_counts() # Gives count of each values

444    2
555    1
666    1
Name: col2, dtype: int64

##### Selecting Data

In [55]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [61]:
newdf = df[(df['col1']>2) & (df['col2'] == 444)]

In [62]:
newdf

   col1  col2 col3
3     4   444  xyz

In [58]:
newdf = df[(df['col1']>2) & (df['col2']==444)]
newdf

   col1  col2 col3
3     4   444  xyz

##### Applying functions

In [63]:
def times2(x):
    return x*2

In [64]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [65]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [66]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [67]:
df['col1'].sum()

10

##### Permanently Removing a column

In [68]:
del df['col1']

In [69]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

##### Get column and index names

In [70]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [71]:
df.index

RangeIndex(start=0, stop=4, step=1)

##### Sorting and Ordering a DataFrame

In [72]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [73]:
df.sort_values(by='col2')

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [74]:
df.sort_values(by='col2', ascending= False)

   col2 col3
2   666  ghi
1   555  def
0   444  abc
3   444  xyz

### Pivot

In [75]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [76]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [78]:
df.pivot_table(values='D', index=['A','B'], columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN